alpha_1.35/0/TauDDES
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/






FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      TauDDES;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];


internalField   nonuniform List<symmTensor>
23276
(
( 1.106223877e-07 -3.632844026e-10 2.354954454e-09 6.139806025e-11 -9.050718508e-11 1.53888351e-07 )
( 4.359510797e-07 -2.090324358e-09 8.600948398e-09 5.250383461e-10 -3.987794539e-10 5.827531595e-07 )
( 1.108212615e-07 -3.656508707e-10 2.107531483e-09 6.169913191e-11 -8.64187541e-11 1.539663401e-07 )
( 1.227258849e-06 -9.670182877e-09 2.269973898e-08 3.167450746e-09 -1.351805445e-09 1.544776978e-06 )
( 4.370036208e-07 -2.097409135e-09 7.939292779e-09 5.26653221e-10 -3.979196139e-10 5.832122838e-07 )
( 1.110733052e-07 -3.643266522e-10 1.842931363e-09 6.152790777e-11 -6.385604545e-11 1.540488626e-07 )
( 2.63093807e-06 -3.14366666e-08 4.826872413e-08 1.255238669e-08 -3.165062656e-09 3.058598622e-06 )
( 1.231054057e-06 -9.69550662e-09 2.162253665e-08 3.170709029e-09 -1.405660588e-09 1.546512635e-06 )
...
)
;

boundaryField
{
    hill
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    top-wall
    {
        type            calculated;
        value           uniform ( 0 0 0 0 0 0 );
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    cyclicAMI_outlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
    cyclicAMI_inlet
    {
        type            cyclicAMI;
        value           uniform ( 0 0 0 0 0 0 );
    }
}


// ************************************************************************* //
